CSI API ETABS v1
cDetailing.GetDetailedWall_OnePier_OneDesignLeg_OneTieBar_OneTiePline_OnePoint Method
 Polyline(s) of the Bar shapes, in Local Design Leg Coordinates
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OnePier_OneDesignLeg_OneTieBar_OneTiePline_OnePoint(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int TieBarIndex,
	int TiePLineIndex,
	int TPLinePointIndex,
	ref double X,
	ref double Y,
	ref double Z
)
Function GetDetailedWall_OnePier_OneDesignLeg_OneTieBar_OneTiePline_OnePoint (
	WallStackIndex As Integer,
	PierIndex As Integer,
	DesignLegIndex As Integer,
	TieBarIndex As Integer,
	TiePLineIndex As Integer,
	TPLinePointIndex As Integer,
	ByRef X As Double,
	ByRef Y As Double,
	ByRef Z As Double
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim PierIndex As Integer
Dim DesignLegIndex As Integer
Dim TieBarIndex As Integer
Dim TiePLineIndex As Integer
Dim TPLinePointIndex As Integer
Dim X As Double
Dim Y As Double
Dim Z As Double
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OnePier_OneDesignLeg_OneTieBar_OneTiePline_OnePoint(WallStackIndex,
	PierIndex, DesignLegIndex, TieBarIndex,
	TiePLineIndex, TPLinePointIndex,
	X, Y, Z)
int GetDetailedWall_OnePier_OneDesignLeg_OneTieBar_OneTiePline_OnePoint(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int TieBarIndex,
	int TiePLineIndex,
	int TPLinePointIndex,
	double% X,
	double% Y,
	double% Z
)
abstract GetDetailedWall_OnePier_OneDesignLeg_OneTieBar_OneTiePline_OnePoint :
        WallStackIndex : int *
        PierIndex : int *
        DesignLegIndex : int *
        TieBarIndex : int *
        TiePLineIndex : int *
        TPLinePointIndex : int *
        X : float byref *
        Y : float byref *
        Z : float byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
PierIndex
Type: System.Int32
 Pier Output Index
DesignLegIndex
Type: System.Int32
 Design leg Index
TieBarIndex
Type: System.Int32
 Tie bar Index
TiePLineIndex
Type: System.Int32
 Tie Polyline Index
TPLinePointIndex
Type: System.Int32
 Tie Polyline Point Index
X
Type: System.Double
 X coordinates
Y
Type: System.Double
 Y coordinates
Z
Type: System.Double
 Z coordinates
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace